files/HX_USER_CHECK_PORT.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:os="os.xsd.v1">
   <soapenv:Header><wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <wsse:UsernameToken wsu:Id="UsernameToken-2" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <wsse:Username>clarity</wsse:Username>
      <wsse:Password >Test1234#</wsse:Password>
    </wsse:UsernameToken>
  </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <os:QUERY-DSLPORTSPECIFYINFO>
         <os:MODIFIER>DSLPORTSPECIFYINFO</os:MODIFIER>
           <os:object>
            <os:DEV>%ADSL_ZTE_DNAME%</os:DEV>
            <os:FN>%HUAWEIX_FN%</os:FN>
            <os:SN>%HUAWEIX_SN%</os:SN>
            <os:PN>%HUAWEIX_PN%</os:PN>
         </os:object>
         <os:Session>1</os:Session>
         <os:objectParas>
            <os:SHOWOPTION>Alias Type AtucStatus AturStatus LineProfile LineType AtucTxRate AturTxRate AtucSnrMgn AturSnrMgn AtucAtn AturAtn AtucOutputPwr AturOutputPwr AtucAttainableRate AturAttainableRate</os:SHOWOPTION>
         </os:objectParas>
      </os:QUERY-DSLPORTSPECIFYINFO>
   </soapenv:Body>
</soapenv:Envelope>